---
kind: method
id: M:Autodesk.Revit.DB.IExternalResourceServer.GetInformationLink
source: html/e6cc4f9f-1bde-18ef-f030-b80dbd02d461.htm
---
# Autodesk.Revit.DB.IExternalResourceServer.GetInformationLink Method

The method that Revit will invoke to obtain a URL address which provides more information about the server.

## Syntax (C#)
```csharp
string GetInformationLink()
```

## Returns
The URL providing server information.